app/auth/authorize_api_request.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def user
    # check if user is in the database
    # memoize user object
    @user ||= User.find(decoded_auth_token[:user_id]) if decoded_auth_token