app/controllers/books_controller.rb

  def index
    books = Book.all
    books = books.where(published: true)
    books = books.where(title: params[:title]) if params[:title].present?
    books = books.where(price: params[:price]) if params[:price].present?
---
SELECT `books`.* FROM `books`
SELECT `books`.* FROM `books` WHERE `books`.`published` = TRUE
SELECT `books`.* FROM `books` WHERE `books`.`published` = TRUE AND `books`.`title` = 'test'
SELECT `books`.* FROM `books` WHERE `books`.`published` = TRUE AND `books`.`title` = 'test1' AND `books`.`price` = 111.0

  def create
    book = Book.create!(book_params)
---
INSERT INTO `books` (`title`, `description`, `price`, `user_id`, `created_at`, `updated_at`) VALUES ('test1', 'book good', 111.0, 1, '2022-06-05 15:01:30.320461', '2022-06-05 15:01:30.320461')

  def destroy
    @book.published = false
    @book.update(book_params)
---
UPDATE `books` SET `books`.`published` = FALSE, `books`.`updated_at` = '2022-06-05 15:12:48.233951' WHERE `books`.`id` = 1

  def find_book
    @book = Book.find(params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`id` = 101 LIMIT 1