app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    users = User.all

INSERT INTO `users` (`name`, `email`, `password_digest`, `author_pseudonym`, `created_at`, `updated_at`) VALUES ('Rails API', 'rails-api-tom-1@gmail.com', '$2a$12$OCY3AIR4Cqy0wuoB8eXcpexri8mmg1MTEBN/miDkinyyME4aglbUO', 'Tom Bob', '2022-06-05 20:26:06.953155', '2022-06-05 20:26:06.953155')
---
  def create
    user = User.create!(user_params)

DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    if @user.author_pseudonym.nil?
      @user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def find_user
    @user = User.find(params[:id])